aabzel/ti_mcu_code_base/boards/stm32_H407/board_layout.c
#include "board_layout.h"

#include "data_utils.h"
#include "gpio_drv.h"
#include "stm32f4xx_hal.h"
#include "sys_config.h"

#ifndef USE_HAL_DRIVER
#error "that wile only for STM32 MCUs"
#endif /*USE_HAL_DRIVER*/

Pin_t PinTable[]={
    {{PORT_A,0},"WKUP",34, GPIO_MODE_IT_RISING, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0, GPIO_PIN_RESET},
    {{PORT_A,1},"PA1",00},
    {{PORT_A,2},"CON3.2",00},
    {{PORT_A,3},"CON3.1",00},
    {{PORT_A,4},"",00},
    {{PORT_A,5},"",00},
    {{PORT_A,6},"",00},
    {{PORT_A,7},"",00},
    {{PORT_A,8},"",00},
    {{PORT_A,9},"",00},
    {{PORT_A,10},"",00},
    {{PORT_A,11},"",00},
    {{PORT_A,12},"",00},
    {{PORT_A,13},"",00},
    {{PORT_A,14},"",00},
    {{PORT_A,15},"",00},

    {{PORT_B,0},"",00},
    {{PORT_B,1},"",00},
    {{PORT_B,2},"",00},
    {{PORT_B,3},"",00},
    {{PORT_B,4},"",00},
    {{PORT_B,5},"",00},
    {{PORT_B,6},"",00},
    {{PORT_B,8},"",00},
    {{PORT_B,9},"",00},
    {{PORT_B,7},"SPI2_CS", 137, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW,       0,             GPIO_PIN_SET},
    {{PORT_B,10},"SPI2_SCK",69, GPIO_MODE_AF_PP,     GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, GPIO_AF5_SPI2, GPIO_PIN_RESET},
    {{PORT_C,2},"SPI2_MISO",28, GPIO_MODE_AF_PP,     GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, GPIO_AF5_SPI2, GPIO_PIN_RESET},
    {{PORT_C,3},"SPI2_MOSI",29, GPIO_MODE_AF_PP,     GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, GPIO_AF5_SPI2, GPIO_PIN_RESET},
    {{PORT_B,11},"",00},
    {{PORT_B,12},"",00},
    {{PORT_B,13},"",00},
    {{PORT_B,14},"",00},
    {{PORT_B,15},"",00},

    {{PORT_C,0},"",00},
    {{PORT_C,1},"",00},
    {{PORT_C,4},"",00},
    {{PORT_C,5},"",00},
    {{PORT_C,6},"USART6_TX",96,GPIO_MODE_AF_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH,GPIO_AF8_USART6, GPIO_PIN_SET},
    {{PORT_C,7},"USART6_RX",97,GPIO_MODE_AF_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH,GPIO_AF8_USART6, GPIO_PIN_SET},
    {{PORT_C,8},"",00},
    {{PORT_C,9},"",00},
    {{PORT_C,10},"",00},
    {{PORT_C,11},"",00},
    {{PORT_C,12},"",00},
    {{PORT_C,13},"LED_G",7,GPIO_MODE_OUTPUT_PP,GPIO_NOPULL,GPIO_SPEED_FREQ_LOW, 0, GPIO_PIN_RESET},
    {{PORT_C,14},"",00},
    {{PORT_C,15},"",00},

    {{PORT_D,0},"",00},
    {{PORT_D,1},"",00},
    {{PORT_D,2},"",00},
    {{PORT_D,3},"",00},
    {{PORT_D,4},"",00},
    {{PORT_D,5},"",00},
    {{PORT_D,6},"",00},
    {{PORT_D,7},"",00},
    {{PORT_D,8},"",00},
    {{PORT_D,9},"",00},
    {{PORT_D,10},"",00},
    {{PORT_D,11},"",00},
    {{PORT_D,12},"",00},
    {{PORT_D,13},"",00},
    {{PORT_D,14},"",00},
    {{PORT_D,15},"",00},

    {{PORT_E,0},"",00},
    {{PORT_E,1},"",00},
    {{PORT_E,2},"",00},
    {{PORT_E,3},"",00},
    {{PORT_E,4},"",00},
    {{PORT_E,5},"",00},
    {{PORT_E,6},"",00},
    {{PORT_E,7},"",00},
    {{PORT_E,8},"",00},
    {{PORT_E,9},"",00},
    {{PORT_E,10},"",00},
    {{PORT_E,11},"",00},
    {{PORT_E,12},"",00},
    {{PORT_E,13},"",00},
    {{PORT_E,14},"",00},
    {{PORT_E,15},"",00},  

    {{PORT_F,0},"",00},
    {{PORT_F,1},"",00},
    {{PORT_F,2},"",00},
    {{PORT_F,3},"",00},
    {{PORT_F,4},"",00},
    {{PORT_F,5},"",00},
    {{PORT_F,6},"",00},
    {{PORT_F,7},"",00},
    {{PORT_F,8},"",00},
    {{PORT_F,9},"",00},
    {{PORT_F,10},"",00},
    {{PORT_F,11},"",00},
    {{PORT_F,12},"",00},
    {{PORT_F,13},"",00},
    {{PORT_F,14},"",00},
    {{PORT_F,15},"",00},  

    {{PORT_G,0},"",00},
    {{PORT_G,1},"",00},
    {{PORT_G,2},"",00},
    {{PORT_G,3},"",00},
    {{PORT_G,4},"",00},
    {{PORT_G,5},"",00},
    {{PORT_G,6},"",00},
    {{PORT_G,7},"",00},
    {{PORT_G,8},"",00},
    {{PORT_G,9},"",00},
    {{PORT_G,10},"",00},
    {{PORT_G,11},"",00},
    {{PORT_G,12},"",00},
    {{PORT_G,13},"",00},
    {{PORT_G,14},"",00},
    {{PORT_G,15},"",00},  

    {{PORT_H,0},"",00},
    {{PORT_H,1},"",00},

};

uint32_t gpio_get_cnt(void){
    return ARRAY_SIZE(PinTable);
}
